#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.http_function_source["describe"]: Reading...
data.archive_file.http_function_source["leaderboard"]: Reading...
data.archive_file.http_function_source["ban"]: Reading...
data.archive_file.http_function_source["froge"]: Reading...
data.archive_file.http_function_source["listwarn"]: Reading...
data.archive_file.http_function_source["hello"]: Reading...
data.archive_file.http_function_source["js"]: Reading...
data.archive_file.http_function_source["warn"]: Reading...
data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=d276adec74a5ac23773986b167399557ae58f455]
data.archive_file.http_function_source["ban"]: Read complete after 0s [id=f18ae3714f39a133deaf558ead8a924d5fe6c229]
data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
data.archive_file.http_function_source["warn"]: Read complete after 0s [id=806c0b50368dd3fd356f7a4f953446c079cf2b33]
data.archive_file.http_function_source["answer"]: Reading...
data.archive_file.http_function_source["help"]: Reading...
data.archive_file.http_function_source["froge"]: Read complete after 0s [id=98990a9f59ec6a8711e7f90924fb0ce1e4b483ad]
data.archive_file.http_function_source["merch"]: Reading...
data.archive_file.http_function_source["go"]: Reading...
data.archive_file.pubsub_function_source["generateLevelImage"]: Reading...
data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8990ff7d100ccf1a9eefa60e2fed3d07432d19e1]
data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
data.archive_file.http_function_source["js"]: Read complete after 0s [id=50404edb26ed317b63bde115825dc58a4c443590]
data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=252109fa737667a04b37534623605057a5f685fd]
data.archive_file.pubsub_function_source["generateLevelImage"]: Read complete after 0s [id=081681664e265df991dd372d34ef22cc3707a678]
data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
data.archive_file.http_function_source["level"]: Reading...
data.archive_file.http_function_source["gif"]: Reading...
data.archive_file.http_function_source["video"]: Reading...
data.archive_file.http_function_source["java"]: Reading...
data.archive_file.http_function_source["merch"]: Read complete after 0s [id=0c291bc81687d36ba46ada3813d2aea646201106]
data.archive_file.http_function_source["go"]: Read complete after 0s [id=605abdfb304cdb07e2c24d982e457c96dfe05abb]
data.archive_file.pubsub_function_source["privateMessage"]: Reading...
data.archive_file.pubsub_function_source["exp"]: Reading...
data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
data.archive_file.http_function_source["level"]: Read complete after 0s [id=9dc95551f99bf616f854d0ba99e7a9704e7e6d5a]
data.archive_file.http_function_source["gif"]: Read complete after 0s [id=531b9967286445e03ddd548761fd5ab6011a40b8]
data.archive_file.http_function_source["video"]: Read complete after 0s [id=8621ce7b6ab180d2bd183faf1d3d1efb95609d53]
data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90]
data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=5305b29788056190ec120eeaca643defb7281d46]
data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=76020855b42b71517b9e66cc6333eaa06593e019]
data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=93ff48c45ffeafd96931e0b86e287b1336eeeeda]
data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=c5afe7e50044a63af3ba94d7b1d9025c6ce7df13]
data.archive_file.pubsub_function_source["channelMessage"]: Reading...
data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=11ee72eeff88c7124659eee1f86ee4cf38b54f5b]
google_storage_bucket.input_bucket: Refreshing state... [id=archy-f06ed-input]
google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket]
google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/channel_message_discord]
google_project_service.firestore: Refreshing state... [id=archy-f06ed/firestore.googleapis.com]
google_cloud_scheduler_job.froge_of_the_day_scheduler: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/jobs/froge_of_the_day]
google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function]
google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/froge_of_the_day]
google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/exp_discord]
google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/update_user_role]
google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/generate_welcome_image]
google_pubsub_topic.pubsub_topic["generate_level_image"]: Refreshing state... [id=projects/archy-f06ed/topics/generate_level_image]
google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/private_message_discord]
google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/cloud_function_error_log]
google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket/allUsers]
google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-src-252109fa737667a04b37534623605057a5f685fd.zip]
google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-src-d276adec74a5ac23773986b167399557ae58f455.zip]
google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-src-98990a9f59ec6a8711e7f90924fb0ce1e4b483ad.zip]
google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-src-8990ff7d100ccf1a9eefa60e2fed3d07432d19e1.zip]
google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-src-9dc95551f99bf616f854d0ba99e7a9704e7e6d5a.zip]
google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
google_storage_bucket_object.http_function_zip["merch"]: Refreshing state... [id=archy-f06ed-function-src-0c291bc81687d36ba46ada3813d2aea646201106.zip]
google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-src-605abdfb304cdb07e2c24d982e457c96dfe05abb.zip]
google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-src-806c0b50368dd3fd356f7a4f953446c079cf2b33.zip]
google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-src-f18ae3714f39a133deaf558ead8a924d5fe6c229.zip]
google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-src-50404edb26ed317b63bde115825dc58a4c443590.zip]
google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-src-531b9967286445e03ddd548761fd5ab6011a40b8.zip]
data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=77997d4a8d0f4606ef9a8d5277a01e05d4b08bdb]
google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-src-5305b29788056190ec120eeaca643defb7281d46.zip]
google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
google_storage_bucket_object.pubsub_function_zip["generateLevelImage"]: Refreshing state... [id=archy-f06ed-function-src-081681664e265df991dd372d34ef22cc3707a678.zip]
google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-src-77997d4a8d0f4606ef9a8d5277a01e05d4b08bdb.zip]
google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-src-c5afe7e50044a63af3ba94d7b1d9025c6ce7df13.zip]
google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-src-76020855b42b71517b9e66cc6333eaa06593e019.zip]
google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-src-58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90.zip]
google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-src-11ee72eeff88c7124659eee1f86ee4cf38b54f5b.zip]
google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/js]
google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/go]
google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/java]
google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/ban]
google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/answer]
google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/froge]
google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/listwarn]
google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/level]
google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/gif]
google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/warn]
google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/describe]
google_cloudfunctions_function.http_function["merch"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/merch]
google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/leaderboard]
google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/hello]
google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/help]
google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/generateWelcomeImage]
google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/privateMessage]
google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/cloudErrorLog]
google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/channelMessage]
google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/frogeOfTheDay]
google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/updateUserRole]
google_cloudfunctions_function.pubsub_function["generateLevelImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/generateLevelImage]
google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/exp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions_function.http_function["video"] will be created
  + resource "google_cloudfunctions_function" "http_function" {
      + available_memory_mb           = 256
      + description                   = "Return the requested youtube video"
      + docker_registry               = (known after apply)
      + entry_point                   = "video"
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 5
      + min_instances                 = 0
      + name                          = "video"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "python39"
      + service_account_email         = "archyapi@archy-f06ed.iam.gserviceaccount.com"
      + source_archive_bucket         = "archy-f06ed-function"
      + source_archive_object         = "src-8621ce7b6ab180d2bd183faf1d3d1efb95609d53.zip"
      + timeout                       = 15
      + trigger_http                  = true
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }

      + secret_environment_variables {
          + key        = "DISCORD_TOKEN"
          + project_id = (known after apply)
          + secret     = "DISCORD_TOKEN"
          + version    = "latest"
        }
      + secret_environment_variables {
          + key        = "YOUTUBE_API_TOKEN"
          + project_id = (known after apply)
          + secret     = "YOUTUBE_API_TOKEN"
          + version    = "latest"
        }
    }

  # google_storage_bucket_object.http_function_zip["video"] will be created
  + resource "google_storage_bucket_object" "http_function_zip" {
      + bucket         = "archy-f06ed-function"
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "src-8621ce7b6ab180d2bd183faf1d3d1efb95609d53.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/video.zip"
      + storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Cor-Lapidem, Action: `pull_request`, Working Directory: ``, Workflow: `Run terraform plan`*